# 捭阖 baihe
纵bai横：合纵连横；捭阖：开合，战国时du策士游说的一种方法。指在政治或外交上运用手段进行分化或拉拢。

“也就是适应外界情形的变化，适应不同对手的情况，“捭阖”有度，灵活地动用恰当的言辞来征服对方，赢得胜利。

”

“正所谓：“真功夫不可告人，自有其理由。”有时是时机不成熟，必须像猎人一样耐心潜伏着，等待猎物出现；有时是为了让对手充分表演，完全彻底地暴露出他的全部招数，然后再抓住其要害给予致命打击，让他领教后发制人的厉害。

”

# “会“装”的都是狠角色”

“有智慧的人，在事物败坏的兆头刚刚出现时就会敏锐地发现，并凭着自己的力量，追寻变化的踪迹，暗中思量琢磨，通盘筹划，找到产生微隙的原因，并想出方法解决。”

“未雨绸缪——没有危机意识就是最大的危机”

“功被天下，守之以让；勇力抚世，守之以怯”

## 抵巇 dixi
可引申爲潛在的矛盾或容易忽視的問題。抵巇，消除潛在的矛盾隔閡。

“欲望无尽头，何时才能够享受清闲快乐的人生呢。

”

“古之善摩者，如操钓而临深渊，饵而投之，必得鱼焉。”

抜粋:: 蒋巍巍, 石玉峰, ePUBw.COM  “鬼谷子的沟通技巧”。 Apple Books  
